{
  "model_type": "mobile_vla",
  "architecture": "kosmos2_mobile_vla",
  "backbone": "microsoft/kosmos-2-patch14-224",
  "hidden_size": 1536,
  "action_dim": 3,
  "window_size": 8,
  "chunk_size": 2,
  "learning_rate": 0.0001,
  "batch_size": 1,
  "num_epochs": 3,
  "loss_function": "huber_loss",
  "image_size": [
    224,
    224
  ],
  "normalize_actions": true,
  "scenarios": [
    "1box_left_vertical",
    "1box_left_horizontal",
    "1box_right_vertical",
    "1box_right_horizontal",
    "2box_left_vertical",
    "2box_left_horizontal",
    "2box_right_vertical",
    "2box_right_horizontal"
  ],
  "performance": {
    "overall_mae": 0.285,
    "threshold_accuracy_0_1": 0.375,
    "per_action_mae": {
      "linear_x": 0.243,
      "linear_y": 0.55,
      "angular_z": 0.062
    },
    "per_action_r2": {
      "linear_x": 0.354,
      "linear_y": 0.293,
      "angular_z": 0.0
    }
  },
  "dataset_size": 72,
  "training_episodes": 52,
  "validation_episodes": 20,
  "model_parameters": 1665537542,
  "created_date": "2025-08-21T03:12:43.124671",
  "framework": "pytorch",
  "transformers_version": "4.41.2"
}